# Маленький недостаток формы входа в систему «Альфа-Клик»

date_time: 2014-03-11 12:56:47 MSK

Я пользуюсь банк-клиентом «Альфа-Клик» и почти все доволен. Но есть одна
маленькая, совершенно несущественная деталь, которая мне жутко, ну просто
феерично, не нравится. Хочу с вами поделиться.

Вот как выглядит форма на первой странице (логин который указан на
скриншоте — это случайный набор цифр, а не мой настоящий логин):

![Страница логина][first]

На этой странице все хорошо. Конечно, можно немного придраться: например,
кнопку лучше назвать «Войти», а не «вход»; вся кнопка должна быть нажимаема,
а не только текст на кнопке; было бы неплохо починить переход между полями
по кнопке tab; вопросительный знак тоже должен являться ссылкой на страницу
восстановления пароля.

После того как человек ввел правильные логин и пароль, он попадает на вторую
страницу, на которой нужно ввести одноразовый пароль из SMS:

![Страница для ввода sms подтверждения][second]

Видите проблему? Вы можете предположить что я считаю проблемой что тут
используются английские кавычки, вместо наших родных кавычек-«ёлочек». Или,
например, то что после фразы «Одноразовый пароль» нет двоеточия. Кстати,
совершенно удивительно но на этой странице нет проблемы с нажиманием кнопки —
тут вся кнопка нажимабельна, в отличии от первой страницы, где работает
только клик по тексту кнопки.

Но нет, все что вы перечислили, это, конечно проблемы, но Главная Проблема
этой страницы — это текст на кнопке.

На кнопке написано «Получить пароль повторно», но это полная ерунда. На
кнопке должен быть текст «Отправить пароль повторно».

Зачем мне повторно получать пароль? Совершенно не за чем, а вот если я не
получил пароль, то мне его нужно повторно отправить.

 [first]: http://upload.bessarabov.ru/bessarabov/jVEp2gAIJB1_-RbJepbuT_28xI8.png
 [second]: http://upload.bessarabov.ru/bessarabov/TCcEH-0LB8IDqQsHe4w53vNNFvY.png
