# Встречи Moscow.pm

date_time: 2014-01-31 10:29:41 MSK

На этой странице собираю информацию о встречах тусовочки Moscow.pm (Perl
программистов Москвы).

С недавнего времени встречи проводятся регулярно в каждый первый четверг
месяца (но иногда встречи отменяются, если в этот месяц проходит другое
крупное Perl мероприятие).

## ...

Было много разных встреч, возможно, я когда-нибудь внесу их в этот список,
пока буду только добавлять новые события.

## 7 ноября 2013

 * Время: 19:30
 * Место: паб Скотланд Ярд, ул. Петровка, 34.

[Фотки со встречи](https://plus.google.com/photos/+IlyaChesnokov/albums/5943848934308019313).

## 5 декабря 2013

 * Время: 19:30 до 22:00
 * Место: переговорная №1 на 2 этаже офиса Mail.Ru Group
 * [Событие на timepad](http://moscowpm0409.timepad.ru/event/95075/)

Доклады:

 * "Создать директорию, что может быть проще?", Денис Евдокимов.
   [YouTube](http://www.youtube.com/watch?v=FtpTgKCDL5Y)
   [Презентация.pdf](https://dl.dropboxusercontent.com/u/72085398/sp_slides/2013/evdokimov/mkdir.pdf).
   Это повторение доклада с конференции [Saint Perl 21 декабря 2013](http://event.yapcrussia.org/saintperl5/talk/244).
 * "Невыносимонов стайл. Обсуждение особенностей работы технического
   руководителя", Дмитрий Симонов [YouTube](http://www.youtube.com/watch?v=7DB86A2nHbc)
 * "Carton – менеджер зависимостей Perl (аля Bundler для Perl)", Леандр
   Халиуллов [YouTube](http://www.youtube.com/watch?v=_UOmVehha1E)

## 2 января 2014

Встречи не было — новый год =)

## 6 февраля 2014

 * Время: с 19:30 до 22:00
 * Место: переговорная №1 на 2 этаже офиса Mail.Ru Group
 * Была камера, так что, возможно, через некоторое время будет запись
 * [Событие на timepad](http://moscowpm.timepad.ru/event/103175/)

В програме:

 * Доклад "Разработка и оптимизация программы на Perl под Raspberry Pi", Илья
   Чесноков. [slideshare.net](http://www.slideshare.net/ichesnokov/raspberry-piperl)
 * Quiz "Array VS List", Павел Щербинин
 * "Круглый стол о вопросах тестирования", Юрий Никулин

## 6 марта 2014

Встречи не было =(

## 3 апреля 2014

 * Время: с 19:00
 * Место: [Пилзнер на Маяковской](http://www.pilsner.ru/about_restaurants/mayakovskaya)

## 1 мая 2014

Пока про встрече ничего не известно, даже не известно будет ли она. Но по
плану встречи проходят в первый четверг каждого месяца.

## 13 и 14 июня 2014 — YAPC::Russia

YAPC::Russia — это самая большая русскоязычная конференция про Perl. В этом
году конференция будет в Санкт-Петербурге 13 и 14 июня (это пятница и
суббота).

 * [Сайт конференции](http://event.yapcrussia.org/yr2014/)
